In [1]:
import pandas as pd

In [15]:
df_games = pd.read_parquet(r'D:\daneshkar\pandas-numpy-matplotlib\x\final_datasets\raw_tennis_power_parquet_all_days.parquet')
df_games

        match_id  set_num  game_num  value  break_occurred
0       11998445        1         1 -52.80           False
1       11998445        1         2  48.14           False
2       11998445        1         3 -51.62           False
3       11998445        1         4  10.00           False
4       11998445        1         5  26.60            True
...          ...      ...       ...    ...             ...
469672  12213803        2         3 -10.00           False
469673  12213803        2         4  10.00           False
469674  12213803        2         5  10.00            True
469675  12213803        2         6  10.00           False
469676  12213803        2         7  28.60            True

[469677 rows x 5 columns]

In [16]:
df_stats = pd.read_parquet(r'D:\daneshkar\pandas-numpy-matplotlib\x\final_datasets\raw_statistics_parquet_all_days.parquet')
df_stats

,match_id,period,statistic_category_name,statistic_name,home_stat,away_stat,compare_code,statistic_type,value_type,home_value,away_value,home_total,away_total
0,11998445,ALL,service,aces,12,6,1,positive,event,12,6,NaN,NaN
1,11998445,ALL,service,double_faults,2,7,2,negative,event,2,7,NaN,NaN
2,11998445,ALL,service,first_serve,57/101 (56%),53/90 (59%),2,positive,team,57,53,101.0,90.0
3,11998445,ALL,service,second_serve,42/44 (95%),30/37 (81%),1,positive,team,42,30,44.0,37.0
4,11998445,ALL,service,first_serve_points,42/57 (74%),39/53 (74%),1,positive,team,42,39,57.0,53.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1358229,12213803,2ND,games,max_games_in_a_row,4,1,1,positive,event,4,1,NaN,NaN
1358230,12213803,2ND,return,first_serve_return_points,10/16 (62%),4/13 (30%),1,positive,team,10,4,16.0,13.0
1358231,12213803,2ND,return,second_serve_return_points,8/14 (57%),6/13 (46%),1,positive,team,8,6,14.0,13.0
1358232,12213803,2ND,return,return_games_played,4,3,1,positive,event,4,3,NaN,NaN
1358233,12213803,2ND,return,break_points_converted,3,0,1,positive,event,3,0,NaN,NaN

In [20]:
break_per_match = df_games.groupby('match_id')['break_occurred'].sum().reset_index()
break_per_match.rename(columns={'break_occurred': 'total_breaks'}, inplace=True)
break_per_match

       match_id  total_breaks
0      11998445            18
1      11998446            12
2      11998447             8
3      11998448             6
4      11998449             3
...         ...           ...
11116  12213482             9
11117  12213483             7
11118  12213484             9
11119  12213486             5
11120  12213803             6

[11121 rows x 2 columns]

In [24]:
df_serves = df_stats[
    (df_stats['statistic_category_name'] == 'service') & 
    (df_stats['statistic_name'] == 'first_serve')
].copy()
filter_serves = df_serves[['match_id' , 'statistic_category_name'  , 'statistic_name']]
filter_serves

         match_id statistic_category_name statistic_name
2        11998445                 service    first_serve
22       11998445                 service    first_serve
39       11998445                 service    first_serve
56       11998445                 service    first_serve
73       11998446                 service    first_serve
...           ...                     ...            ...
1358149  12213486                 service    first_serve
1358166  12213486                 service    first_serve
1358183  12213803                 service    first_serve
1358203  12213803                 service    first_serve
1358220  12213803                 service    first_serve

[76181 rows x 3 columns]

In [29]:
merged_total = pd.merge( filter_serves , break_per_match , on= 'match_id' )
merged_total

       match_id statistic_category_name statistic_name  total_breaks
0      11998445                 service    first_serve            18
1      11998445                 service    first_serve            18
2      11998445                 service    first_serve            18
3      11998445                 service    first_serve            18
4      11998446                 service    first_serve            12
...         ...                     ...            ...           ...
74524  12213486                 service    first_serve             5
74525  12213486                 service    first_serve             5
74526  12213803                 service    first_serve             6
74527  12213803                 service    first_serve             6
74528  12213803                 service    first_serve             6

[74529 rows x 4 columns]

In [30]:
merged_total.groupby('match_id')['total_breaks'].mean()

match_id
11998445    18.0
11998446    12.0
11998447     8.0
11998448     6.0
11998449     3.0
            ...
12213482     9.0
12213483     7.0
12213484     9.0
12213486     5.0
12213803     6.0
Name: total_breaks, Length: 11116, dtype: float64